http/results/retro-httpcats-d1-R20000.txt
Running 20s test @ http://127.0.0.1:18960/
  4 threads and 100 connections
  Thread calibration: mean lat.: 2.256ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.357ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.559ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.630ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.76ms    0.88ms  11.19ms   69.77%
    Req/Sec     5.27k   479.09     8.00k    78.52%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.65ms
 75.000%    3.31ms
 90.000%    3.87ms
 99.000%    5.17ms
 99.900%    7.71ms
 99.990%   10.33ms
 99.999%   11.18ms
100.000%   11.20ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.286     0.000000            1         1.00
       1.733     0.100000        19745         1.11
       2.005     0.200000        39564         1.25
       2.231     0.300000        59356         1.43
       2.437     0.400000        79110         1.67
       2.653     0.500000        98812         2.00
       2.769     0.550000       108641         2.22
       2.893     0.600000       118576         2.50
       3.025     0.650000       128443         2.86
       3.165     0.700000       138279         3.33
       3.313     0.750000       148113         4.00
       3.391     0.775000       153017         4.44
       3.473     0.800000       157976         5.00
       3.559     0.825000       162875         5.71
       3.649     0.850000       167849         6.67
       3.753     0.875000       172755         8.00
       3.809     0.887500       175211         8.89
       3.871     0.900000       177686        10.00
       3.937     0.912500       180149        11.43
       4.013     0.925000       182626        13.33
       4.103     0.937500       185158        16.00
       4.155     0.943750       186398        17.78
       4.211     0.950000       187582        20.00
       4.275     0.956250       188793        22.86
       4.351     0.962500       190027        26.67
       4.447     0.968750       191276        32.00
       4.503     0.971875       191895        35.56
       4.567     0.975000       192493        40.00
       4.639     0.978125       193111        45.71
       4.727     0.981250       193719        53.33
       4.847     0.984375       194343        64.00
       4.911     0.985938       194639        71.11
       4.995     0.987500       194954        80.00
       5.099     0.989062       195260        91.43
       5.223     0.990625       195564       106.67
       5.391     0.992188       195873       128.00
       5.503     0.992969       196026       142.22
       5.651     0.993750       196181       160.00
       5.823     0.994531       196335       182.86
       6.007     0.995313       196492       213.33
       6.203     0.996094       196643       256.00
       6.343     0.996484       196720       284.44
       6.475     0.996875       196798       320.00
       6.639     0.997266       196875       365.71
       6.835     0.997656       196953       426.67
       7.039     0.998047       197029       512.00
       7.155     0.998242       197071       568.89
       7.283     0.998437       197107       640.00
       7.415     0.998633       197146       731.43
       7.583     0.998828       197184       853.33
       7.751     0.999023       197222      1024.00
       7.907     0.999121       197242      1137.78
       8.071     0.999219       197260      1280.00
       8.223     0.999316       197281      1462.86
       8.423     0.999414       197299      1706.67
       8.607     0.999512       197318      2048.00
       8.695     0.999561       197328      2275.56
       8.783     0.999609       197337      2560.00
       8.911     0.999658       197347      2925.71
       8.991     0.999707       197357      3413.33
       9.175     0.999756       197366      4096.00
       9.279     0.999780       197371      4551.11
       9.551     0.999805       197376      5120.00
       9.719     0.999829       197381      5851.43
       9.903     0.999854       197386      6826.67
      10.007     0.999878       197390      8192.00
      10.319     0.999890       197393      9102.22
      10.359     0.999902       197395     10240.00
      10.583     0.999915       197398     11702.86
      10.607     0.999927       197400     13653.33
      10.647     0.999939       197402     16384.00
      10.743     0.999945       197404     18204.44
      10.855     0.999951       197405     20480.00
      10.887     0.999957       197406     23405.71
      10.903     0.999963       197407     27306.67
      10.919     0.999969       197408     32768.00
      10.991     0.999973       197409     36408.89
      11.087     0.999976       197410     40960.00
      11.087     0.999979       197410     46811.43
      11.111     0.999982       197411     54613.33
      11.111     0.999985       197411     65536.00
      11.183     0.999986       197412     72817.78
      11.183     0.999988       197412     81920.00
      11.183     0.999989       197412     93622.86
      11.191     0.999991       197413    109226.67
      11.191     0.999992       197413    131072.00
      11.191     0.999993       197413    145635.56
      11.191     0.999994       197413    163840.00
      11.191     0.999995       197413    187245.71
      11.199     0.999995       197414    218453.33
      11.199     1.000000       197414          inf
#[Mean    =        2.759, StdDeviation   =        0.878]
#[Max     =       11.192, Total count    =       197414]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  398721 requests in 20.00s, 796.24MB read
Requests/sec:  19937.83
Transfer/sec:     39.82MB

JSON Output:
{
	"requests": 398721,
	"duration_in_microseconds": 19998212.00,
	"bytes": 834921774,
	"requests_per_sec": 19937.83,
	"bytes_transfer_per_sec": 41749821.13,
	"latency_distribution": [
		{
			"percentile": 50,
			"latency_in_microseconds": 2653
		},
		{
			"percentile": 75,
			"latency_in_microseconds": 3313
		},
		{
			"percentile": 90,
			"latency_in_microseconds": 3871
		},
		{
			"percentile": 99,
			"latency_in_microseconds": 5167
		},
		{
			"percentile": 99.9,
			"latency_in_microseconds": 7711
		},
		{
			"percentile": 99.99,
			"latency_in_microseconds": 10327
		},
		{
			"percentile": 99.999,
			"latency_in_microseconds": 11183
		},
		{
			"percentile": 100,
			"latency_in_microseconds": 11199
		}
	]
}